{"0":"There is no error description provided. Mostly returned for successful delivery, or when error code was not returned by the operator.","1":"The number does not exist or it has not been assigned to any active subscriber in the operator’s user database.","10":"Bearer Service Not Provisioned","1024":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1025":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1026":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1027":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1028":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1029":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1030":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","1031":"Mobile subscriber was not reachable due to a network operator protocol error.","11":"The subscriber’s mobile service has been suspended by the operator.","1152":"Mobile subscriber was not reachable due to a network operator protocol error.","1153":"No Translation For This Specific Address","1154":"Mobile subscriber was not reachable due to a network operator protocol error.","1155":"Mobile subscriber was not reachable due to a network operator protocol error.","1156":"Mobile subscriber was not reachable due to a network operator protocol error.","1157":"Mobile subscriber was not reachable due to a network operator protocol error.","1158":"Mobile subscriber was not reachable due to a network operator protocol error.","1159":"Mobile subscriber was not reachable due to a network operator protocol error.","1160":"Mobile subscriber was not reachable due to a network operator protocol error.","1161":"Mobile subscriber was not reachable due to a network operator protocol error.","1162":"Mobile subscriber was not reachable due to a network operator protocol error.","1163":"Mobile subscriber was not reachable due to a network operator protocol error.","1164":"Mobile subscriber was not reachable due to a network operator protocol error.","1165":"Mobile subscriber was not reachable due to a network operator protocol error.","1166":"Mobile subscriber was not reachable due to a network operator protocol error.","12":"Illegal Equipment","1281":"Message was aborted by network peer because of a network protocol error.","1282":"Message was aborted by network peer because of a network protocol error.","1283":"Message was aborted by network peer because of a network protocol error.","1284":"Message was aborted by network peer because of a network protocol error.","13":"Message is rejected due to barring of message service; blocking is set by operator or subscriber for the number.","1536":"Message was aborted due to other network protocol errors.","1537":"Message was aborted due to other network protocol errors.","1538":"Message was aborted due to other network protocol errors.","1539":"Message was aborted due to other network protocol errors.","1540":"Message was aborted due to other network protocol errors.","1541":"Message was aborted due to other network protocol errors.","1792":"Message was aborted due to other network protocol errors.","1793":"Message was aborted due to other network protocol errors.","1794":"Message was aborted due to other network protocol errors.","1795":"Message was aborted due to other network protocol errors.","1796":"Message was aborted due to other network protocol errors.","20":"SS Incompatibility","2048":"Time Out","2049":"IMSI blocklisted","2050":"The number was flagged as blocklisted in the DND (Do Not Disturb) blocklist provided by the operator, or the same error code was reverted by the operator.","2051":"Text blocklisted","2052":"The destination number has been blocklisted either at the operator`s request or on your account via DLT web interface. Go contact Support for more information.","2053":"Source address is blocklisted on the Infobip account.","21":"Facility Not Supported","255":"Unknown Error","256":"There has been a mobile subscriber equipment error whereas the handset memory has been exceeded.","257":"There has been a mobile subscriber equipment error.","258":"There has been a mobile subscriber equipment error.","259":"There has been a mobile subscriber equipment error.","260":"There has been a mobile subscriber equipment error.","261":"There has been a mobile subscriber equipment error.","262":"There has been a mobile subscriber equipment error.","27":"The subscriber is offline in the network, as confirmed by the handset’s paging response. This is often due to the handset being switched off.","31":"Subscriber Busy For Mt SMS","32":"SM Delivery Failure","323":"Request type was invalid.","33":"Message Waiting List Full","34":"System Failure","345":"Mobile operator not found for the destination address. The service performed a dynamic carrier lookup for the destination address, but it could not be identified; or, the MT source address is not a North American toll-free phone number or landline.","35":"Data Missing","351":"Invalid destination address. Possible reasons of receiving this error for the following mobile operators might be:","352":"Invalid request - destination address country code is not recognized.","355":"Message text is too long.","36":"Unexpected Data Value","368":"Invalid source address value. The mobile operator rejected the message with an invalid MT source address error. Contact your account manager to determine if your MT source address should be supported by the end user's mobile operator.","375":"Source address (recipient) is blocked or is not provisioned.","4096":"Invalid PDU Format","4097":"Not Submitted To GMSC","4099":"Your account monthly credit limit has been reached. For further financial assistance, please contact your account manager.","4100":"The request was received, but has not been sent to the next instance within its validity period and has expired with the appropriate error code EC_MESSAGE_CANCELED, or the same error code was reverted from the operator.","4101":"The message was sent to the next instance and has not been delivered within the message validity period, thus it has expired with the appropriate error code EC_VALIDITYEXPIRED or the error code was reverted from the operator.","4102":"Not Submitted To Smpp Channel","4103":"Related to status REJECTED_FLOODING_FILTER, the message is rejected due to the number of messages sent to a single number.","4104":"Related to status REJECTED_FLOODING_FILTER, the message is rejected due to the number of identical messages sent to a single number.","4106":"Message blocked by DLT Scrubbing.","4107":"Timeout while performing DLT Scrubbing.","4108":"Sender blocked by DLT Scrubbing.","4109":"Telemarketer blocked by DLT Scrubbing.","4110":"Entity blocked by DLT Scrubbing.","4111":"Template blocked by DLT Scrubbing.","4112":"No record found with EID as primary key. ","4113":"No entry of entity on the platform. ","4114":"Entity is inactive on the platform.               ","4115":"Entity is blacklisted on all platforms.","4116":"Received wrong entity id format or no entity.","4117":"Principal entity is not allowed for the TM.","4118":"No entry of TMID on the platform.","4119":"Telemarketer is inactive on the platform.","4120":"Telemarketer is blacklisted on all platforms.","4121":"No record found with header (case sensitive).","4122":"Header is inactive on the platform.","4123":"Header is blacklisted on all platforms.","4124":"Principle Entity Id is not matched with Header Id.","4125":"Header in free pool. ","4126":"No record found with Template Id as primary key\/no template found.","4127":"Template is inactive on the platform.","4128":"Template is blacklisted on all platforms.","4129":"Template not matched for given Template Id. ","4130":"Header is not registered for the template.","4131":"Variable length exceeded the max configured length.","4132":"Error in identifying the template.","4133":"Received wrong Template Id format or no Template Id tag.","4134":"Template does not belong to PE.","4135":"Promotional Template used on other\/transaction header.","4136":"Invalid template type. ","4137":"Blocked in preferences with MSISDN as PK.","4138":"Block promo hours (9PM to 10AM). ","4139":"SE category blocking on fully DND, if consent not available.","4140":"General error code for Consent.","4141":"General error code in case of any exceptions.","4142":"TLV PEID missing\/empty\/null.","4143":"TLV TMPID missing\/empty\/null.","433":"Account access denied.","5":"Unidentified Subscriber","500":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","501":"Invalid Response Received","502":"The message has been successfully processed and forwarded to the operator, but no response was returned from the operator upon the message submit request, or such error was reverted by the operator. The error also applies to similar errors on SS7 network level.","503":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","504":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","507":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","508":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","509":"General network protocol error caused by incompatible operator network protocol versions or parameters between two network components.","51":"Indicates that invoked MAP operation could not be finished due to the network congestion - this is an SS7 network congestion error on the MAP protocol level.","541":"Carrier sending limit has been reached. The message was blocked by AT&T because the TPS (transactions per second) limit on your messaging campaign has been exceeded.","542":"Carrier daily quota reached. The message was blocked by T-Mobile because the daily volume limit for your brand has been exceeded. You cannot resend the message until the next day.","5492":"The same message has already been sent to this destination address.","560":"Mobile operator blocking the end user from this Short Code","561":"Content blocked by mobile operator for this end user.","562":"Short code not provisioned with mobile operator. Contact your dedicated Account Manager if you believe that you are provisioned for the operator or if you want to begin provisioning.","563":"Short code expired with mobile operator. Contact your dedicated Account Manager if you believe that you are provisioned for the operator or if you want to begin provisioning.","564":"Short Code blocked by mobile operator. The mobile operator rejected the message as the Short Code is currently blocked from sending messages across their network. Contact your dedicated Account Manager if you are unsure why you received this error.","565":"End users connected to this MVNO cannot receive Short Code messages. The mobile operator rejected the message as the end user is connected to their network via a mobile virtual network operator (MVNO). This restriction is on Short Code messages.","566":"The mobile operator is blocking the phone number from receiving messages from Short Codes. This is likely due to the end-user's account being suspended or barred in some way.","568":"Destination address not provisioned for SMS.","569":"Destination address suspended by the mobile operator.","571":"Program ID or Campaign ID rejected by mobile operator. This error applies to messages sent to US mobile operators. The error indicates the program ID or campaign ID in the message request is not provisioned with the mobile operator. Contact your dedicated Account Manager if you are unsure why you received this error.","572":"Program ID or campaign ID is not provisioned for this mobile operator or is not active.","573":"The end user has asked their mobile operator to block any messages sent from your Short Code. Additional messages from the same Short Code must not be sent to the phone number unless the end user opts in again.","574":"New subscriptions for this short code are blocked by the mobile operator. Indicates that for a given Short Code, new subscribers are not allowed to receive or send messages. However, existing subscribers are still allowed to receive and send messages.","577":"Account not provisioned to use SMS demo short code.","578":"Exceeded the time limit for using SMS demo.","579":"Destination address not in whitelist for SMS demo.","580":"Exceeded the maximum number of demo requests.","581":"End user out of prepay credit. The end user does not have enough credit on their phone account to receive the message. Message sending can be retried every 24 hours for no more than seven days.","594":"Invalid global campaign ID.","597":"Account is not provisioned with the address that can reach the destination.","598":"Interaction not supported for message destination.","6":"The subscriber is detected unavailable as there was no paging response from the handset. This is often due to the handset being switched off or low signal area. Applies to MAP protocol version 3.","601":"Account is not provisioned for global two-way SMS.","603":"Content blocked by user opt-out (MO: STOP). This code can be returned in a delivery receipt for an MT originating from a North American, SMS-enabled toll-free number or an SMS-enabled landline number. Messaging can resume to the end user if the end user opts back in to your program.","604":"Content blocked by campaign black list.","607":"This message was identified as spam and cannot be delivered","628":"Temporary handset failure.","629":"Destination address unable to receive SMS.","630":"Destination overloaded.","631":"Mobile operator network error.","632":"SMS rejected by the mobile operator for attempted destination address.","633":"template content mismatch due to special character","71":"Unknown Alphabet","8":"The subscriber is currently in roaming in another country or other operator’s infrastructure - roaming delivery is not guaranteed due to lack of roaming agreements between many different operators.","810":"Failed message delivery.","811":"Message expired before it reached handset.","815":"Message submitted to but not acknowledged by the mobile operator.","9":"Illegal Subscriber","002":"tsert","003":"asd","004":"qwerr","888":"Header in free pool. ","142":"The message was sent to the next instance and has not been delivered within the message validity period, thus it has expired with the appropriate error code EC_VALIDITYEXPIRED or the error code was reverted from the operator."}